<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc" style="margin-top: 1em;"><ul class="toc-item"><li><span><a href="#增加行" data-toc-modified-id="增加行-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>增加行</a></span></li><li><span><a href="#增加列" data-toc-modified-id="增加列-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>增加列</a></span></li><li><span><a href="#删除列" data-toc-modified-id="删除列-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>删除列</a></span></li><li><span><a href="#合并" data-toc-modified-id="合并-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>合并</a></span></li><li><span><a href="#修改列名" data-toc-modified-id="修改列名-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>修改列名</a></span></li><li><span><a href="#选取列" data-toc-modified-id="选取列-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>选取列</a></span></li><li><span><a href="#遍历" data-toc-modified-id="遍历-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>遍历</a></span></li><li><span><a href="#Apply" data-toc-modified-id="Apply-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Apply</a></span><ul class="toc-item"><li><span><a href="#列元素" data-toc-modified-id="列元素-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>列元素</a></span></li><li><span><a href="#行元素" data-toc-modified-id="行元素-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>行元素</a></span></li><li><span><a href="#列" data-toc-modified-id="列-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>列</a></span></li><li><span><a href="#行" data-toc-modified-id="行-8.4"><span class="toc-item-num">8.4&nbsp;&nbsp;</span>行</a></span></li><li><span><a href="#逐个元素处理" data-toc-modified-id="逐个元素处理-8.5"><span class="toc-item-num">8.5&nbsp;&nbsp;</span>逐个元素处理</a></span></li></ul></li><li><span><a href="#读/写-CSV" data-toc-modified-id="读/写-CSV-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>读/写 CSV</a></span><ul class="toc-item"><li><span><a href="#跳过首行、指定列名" data-toc-modified-id="跳过首行、指定列名-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>跳过首行、指定列名</a></span></li></ul></li><li><span><a href="#类型转化" data-toc-modified-id="类型转化-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>类型转化</a></span><ul class="toc-item"><li><span><a href="#to_dict()-与-dict()-比较" data-toc-modified-id="to_dict()-与-dict()-比较-10.1"><span class="toc-item-num">10.1&nbsp;&nbsp;</span>to_dict() 与 dict() 比较</a></span></li></ul></li></ul></div>

## 增加行

方法一：

In [63]:
import pandas as pd
df = pd.DataFrame(columns=['col1', 'col2', 'col3'])
for i in range(5):
    df.loc[i] = [i] * 3
df

  col1 col2 col3
0    0    0    0
1    1    1    1
2    2    2    2
3    3    3    3
4    4    4    4

方法二：

In [65]:
import pandas as pd
df = pd.DataFrame(columns=['col1', 'col2', 'col3'])
for i in range(5):
    df = df.append(pd.Series({'col1': i * 2, 'col2': i * 2, 'col3': [i] * 2}), ignore_index=True)
df

  col1 col2    col3
0    0    0  [0, 0]
1    2    2  [1, 1]
2    4    4  [2, 2]
3    6    6  [3, 3]
4    8    8  [4, 4]

## 增加列

方法一：

In [71]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10,15)})
df.assign(col4=['tangting'] * len(df))

   col1  col2  col3      col4
0     0     5    10  tangting
1     1     6    11  tangting
2     2     7    12  tangting
3     3     8    13  tangting
4     4     9    14  tangting

方法二：

In [79]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10,15)})
df['col4'] = ['jiexiao'] * len(df)
df

   col1  col2  col3     col4
0     0     5    10  jiexiao
1     1     6    11  jiexiao
2     2     7    12  jiexiao
3     3     8    13  jiexiao
4     4     9    14  jiexiao

## 删除列

In [15]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10,15)})
df['col4'] = ['jiexiao'] * len(df)
df
df.pop('col3')
type(df.pop('col1'))
df

   col1  col2  col3     col4
0     0     5    10  jiexiao
1     1     6    11  jiexiao
2     2     7    12  jiexiao
3     3     8    13  jiexiao
4     4     9    14  jiexiao

0    10
1    11
2    12
3    13
4    14
Name: col3, dtype: int64

pandas.core.series.Series

   col2     col4
0     5  jiexiao
1     6  jiexiao
2     7  jiexiao
3     8  jiexiao
4     9  jiexiao

## 合并

In [81]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5), 'col3': range(5)})
df1 = pd.DataFrame({'col1': range(5,10), 'col2': range(5,10), 'col3': range(5,10)})
pd.concat([df, df1])

   col1  col2  col3
0     0     0     0
1     1     1     1
2     2     2     2
3     3     3     3
4     4     4     4
0     5     5     5
1     6     6     6
2     7     7     7
3     8     8     8
4     9     9     9

## 修改列名

替换原有名称

In [99]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5), 'col3': range(5)})
df.rename(columns={'col1': 'new_col_1', 'col2': 'new_col_2', 'col3': 'new_col_3'})

   new_col_1  new_col_2  new_col_3
0          0          0          0
1          1          1          1
2          2          2          2
3          3          3          3
4          4          4          4

按列序号直接修改，注意 inplace 参数为 pandas-0.21 新增

In [3]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5), 'col3': range(5)})
df.set_axis(labels=['new_col_1', 'new_col_2', 'new_col_3'], axis='columns', inplace=False)

   new_col_1  new_col_2  new_col_3
0          0          0          0
1          1          1          1
2          2          2          2
3          3          3          3
4          4          4          4

## 选取列

In [14]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5), 'col3': range(5)})
df1 = df.loc[:, ['col1', 'col3']]
df1

   col1  col3
0     0     0
1     1     1
2     2     2
3     3     3
4     4     4

可以看出来 loc 函数返回的是一个副本而不是引用

In [17]:
df1.set_axis(labels=['new_col_1', 'new_col_3'], axis='columns', inplace=True)
df1
df

   new_col_1  new_col_3
0          0          0
1          1          1
2          2          2
3          3          3
4          4          4

   col1  col2  col3
0     0     0     0
1     1     1     1
2     2     2     2
3     3     3     3
4     4     4     4

## 遍历

In [24]:
import pandas as pd
df = pd.DataFrame({'col1': [str(x) for x in range(5)], 'col2': [str(x) for x in range(5)], 'col3': [str(x) for x in range(5)]})
df
df.apply(lambda x: ' '.join(x))

  col1 col2 col3
0    0    0    0
1    1    1    1
2    2    2    2
3    3    3    3
4    4    4    4

col1    0 1 2 3 4
col2    0 1 2 3 4
col3    0 1 2 3 4
dtype: object

In [21]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5), 'col3': range(5)})
df
for idx,row in df.iterrows():
    print((row['col1'], row['col3']))

   col1  col2  col3
0     0     0     0
1     1     1     1
2     2     2     2
3     3     3     3
4     4     4     4

(0, 0)
(1, 1)
(2, 2)
(3, 3)
(4, 4)

## Apply

### 列元素

In [37]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10, 15)})
df
df.loc[:, ['col1', 'col2']].apply(lambda x: x * x)

   col1  col2  col3
0     0     5    10
1     1     6    11
2     2     7    12
3     3     8    13
4     4     9    14

   col1  col2
0     0    25
1     1    36
2     4    49
3     9    64
4    16    81

### 行元素

In [39]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10, 15)})
df
df.loc[1:3].apply(lambda x: x * x)

   col1  col2  col3
0     0     5    10
1     1     6    11
2     2     7    12
3     3     8    13
4     4     9    14

   col1  col2  col3
1     1    36   121
2     4    49   144
3     9    64   169

### 列

In [65]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10, 15)})
df
df.apply(lambda x: sum(x))

   col1  col2  col3
0     0     5    10
1     1     6    11
2     2     7    12
3     3     8    13
4     4     9    14

col1    10
col2    35
col3    60
dtype: int64

### 行

In [66]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10, 15)})
df
df.apply(lambda x: sum(x), axis=1)

   col1  col2  col3
0     0     5    10
1     1     6    11
2     2     7    12
3     3     8    13
4     4     9    14

0    15
1    18
2    21
3    24
4    27
dtype: int64

### 逐个元素处理

可以理解为 apply 传入的一定是一个 Series，如果需要特殊处理，需要转换为 list 最后再转换回去

In [77]:
import pandas as pd
lst = [str(x) + '\n             ' for x in range(5)]
df = pd.DataFrame({'col1': lst, 'col2': lst, 'col3': lst})
df
df.apply(lambda x:  pd.Series([y.strip() if isinstance(y, str) else y for y in x]))

               col1              col2              col3
0  0\n               0\n               0\n
1  1\n               1\n               1\n
2  2\n               2\n               2\n
3  3\n               3\n               3\n
4  4\n               4\n               4\n

  col1 col2 col3
0    0    0    0
1    1    1    1
2    2    2    2
3    3    3    3
4    4    4    4

In [79]:
import pandas as pd
lst = [str(x) + '\n             ' for x in range(5)]
df = pd.DataFrame({'col1': lst, 'col2': lst, 'col3': lst})
df
df.apply(lambda x: pd.Series((x['col1'], x['col2'])), axis=1)

               col1              col2              col3
0  0\n               0\n               0\n
1  1\n               1\n               1\n
2  2\n               2\n               2\n
3  3\n               3\n               3\n
4  4\n               4\n               4\n

                  0                 1
0  0\n               0\n
1  1\n               1\n
2  2\n               2\n
3  3\n               3\n
4  4\n               4\n

## 读/写 CSV

In [18]:
import pandas as pd
BAW_PATH = "/aiml/data/NoS_AW_Script/aw_baw.csv"
CAW_PATH = "/aiml/data/NoS_AW_Script/aw_caw.csv"
df_caw = pd.read_csv(CAW_PATH)
df_baw = pd.read_csv(BAW_PATH)
len(df_caw)
len(df_baw)

32317

6832

In [105]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10, 15)})
df.to_csv('/tmp/tmp.csv', index=False)
pd.read_csv('/tmp/tmp.csv')

   col1  col2  col3
0     0     5    10
1     1     6    11
2     2     7    12
3     3     8    13
4     4     9    14

### 跳过首行、指定列名

In [5]:
import pandas as pd

CSV_COLUMN_NAMES = ['SepalLength', 'SepalWidth',
                    'PetalLength', 'PetalWidth', 'Species']

train_path = "/tmp/iris_test.csv"
!head {train_path}

30,4,setosa,versicolor,virginica
5.9,3.0,4.2,1.5,1
6.9,3.1,5.4,2.1,2
5.1,3.3,1.7,0.5,0
6.0,3.4,4.5,1.6,1
5.5,2.5,4.0,1.3,1
6.2,2.9,4.3,1.3,1
5.5,4.2,1.4,0.2,0
6.3,2.8,5.1,1.5,2
5.6,3.0,4.1,1.3,1

In [7]:
tmp1 = pd.read_csv(train_path, names=CSV_COLUMN_NAMES, header=0)
tmp1 = tmp1.head()
tmp1

   SepalLength  SepalWidth  PetalLength  PetalWidth  Species
0          5.9         3.0          4.2         1.5        1
1          6.9         3.1          5.4         2.1        2
2          5.1         3.3          1.7         0.5        0
3          6.0         3.4          4.5         1.6        1
4          5.5         2.5          4.0         1.3        1

## 类型转化

### to_dict() 与 dict() 比较

可以看到，如果用强制转换，则每一列的内容依然为 Series，而使用 to_dict 内置函数则列信息变成了 dict

In [35]:
import pandas as pd
df = pd.DataFrame({'col1': range(5), 'col2': range(5, 10), 'col3': range(10,15)})
df
type(df.to_dict())
type(dict(df))
# 两种转换后，字典的key一致
df.to_dict().keys() == dict(df).keys()
# 两种转换后，value的类型不一致
type(df.to_dict()['col1'])
type(dict(df)['col1'])
# 经过多次转换，可以看出，保存的值还是一致的
list(df.to_dict()['col1'].values()) == dict(df)['col1'].tolist()
# 可以看出 to_dict 相当于是递归调用的
df.to_dict()['col1']== dict(df)['col1'].to_dict()

   col1  col2  col3
0     0     5    10
1     1     6    11
2     2     7    12
3     3     8    13
4     4     9    14

dict

dict

True

dict

pandas.core.series.Series

True

True